# Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

x1 = int(input('Введите номер буквы: '))

print('Буква: ', chr(x1 + 96))
